## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 127 to add, 81 to change, 36 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-Idam-Dev&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].time_rotating.one_year
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CNP-DEV&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-NonProd&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_subscription.this
* Delete
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_subscription.this
* Replace
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["CFT-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
        name                       = "CFT-NonProd"
      ~ subscription_ids           = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_application.acme_appreg[0] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_application" "acme_appreg" {
      - app_role_ids                   = {} -> null
      - application_id                 = "8c346d53-30d2-4e02-b513-785fa3bc3589" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "acme-dcd-cft-idam-dev" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "8dcc48ae-67f5-490c-b354-b5d1d5bd3eff" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {
          - "user_impersonation" = "942ab52b-e720-4131-a438-66e24abb4ab0"
        } -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "8dcc48ae-67f5-490c-b354-b5d1d5bd3eff" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "HMCTS.NET" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access acme-dcd-cft-idam-dev on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access acme-dcd-cft-idam-dev" -> null
              - enabled                    = true -> null
              - id                         = "942ab52b-e720-4131-a438-66e24abb4ab0" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access acme-dcd-cft-idam-dev on your behalf." -> null
              - user_consent_display_name  = "Access acme-dcd-cft-idam-dev" -> null
              - value                      = "user_impersonation" -> null
            }
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d" -> null
              - type = "Scope" -> null
            }
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - timeouts {}

      - web {
          - redirect_uris = [
              - "https://acmedcdcftidamdev.azurewebsites.net/.auth/login/aad/callback",
            ] -> null

          - implicit_grant {
              - access_token_issuance_enabled = true -> null
              - id_token_issuance_enabled     = true -> null
            }
        }
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_application.app will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_application" "app" {
      - app_role_ids                   = {} -> null
      - application_id                 = "fe8dd197-aca7-47d4-9b9b-1f00cfc5278e" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "DTS Bootstrap (sub:dcd-cft-idam-dev)" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "5d8133ed-cfd5-4c0c-a2d7-d82c836cd63f" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {
          - "user_impersonation" = "2fb7cf65-c035-429f-b737-52e7009c6e50"
        } -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "5d8133ed-cfd5-4c0c-a2d7-d82c836cd63f" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "HMCTS.NET" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cft-idam-dev) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cft-idam-dev)" -> null
              - enabled                    = true -> null
              - id                         = "2fb7cf65-c035-429f-b737-52e7009c6e50" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cft-idam-dev) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cft-idam-dev)" -> null
              - value                      = "user_impersonation" -> null
            }
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - timeouts {}

      - web {
          - homepage_url  = "https://dts-bootstrap-application" -> null
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = true -> null
            }
        }
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group.groups["Contributor"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group" "groups" {
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "DCD-CFT-IDAM-DEV Subscription Contributors" -> null
      - display_name               = "DTS Contributors (sub:dcd-cft-idam-dev)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "cc6d3dcf-e452-445f-9656-3f70cdc11672" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "394a065d-4a18-48f5-bd30-dd406c77cda2" -> null
      - members                    = [
          - "00b254b2-7b8a-457d-9aa4-e59ce997d863",
          - "11743ca2-05f1-48f9-a28a-e62f3075ddc4",
          - "53d031cd-a3e5-410e-a694-733874102a45",
        ] -> null
      - object_id                  = "cc6d3dcf-e452-445f-9656-3f70cdc11672" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = false -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group.groups["Owner"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group" "groups" {
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "DCD-CFT-IDAM-DEV Subscription Owners" -> null
      - display_name               = "DTS Owners (sub:dcd-cft-idam-dev)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "00b254b2-7b8a-457d-9aa4-e59ce997d863" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "10b81362-f427-4205-81a2-db07327f941f" -> null
      - members                    = [] -> null
      - object_id                  = "00b254b2-7b8a-457d-9aa4-e59ce997d863" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = false -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group.groups["Reader"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group" "groups" {
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "DCD-CFT-IDAM-DEV Subscription Readers" -> null
      - display_name               = "DTS Readers (sub:dcd-cft-idam-dev)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "28bc2a45-9313-445b-a09c-2a6f31132d14" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "0bb7f13a-5c5d-411d-983d-3851df408ef9" -> null
      - members                    = [
          - "e6c7b379-03ba-483d-ae1d-f3cab6579a6f",
        ] -> null
      - object_id                  = "28bc2a45-9313-445b-a09c-2a6f31132d14" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = false -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group.groups["Storage Blob Data Reader"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group" "groups" {
      - assignable_to_role         = false -> null
      - auto_subscribe_new_members = false -> null
      - behaviors                  = [] -> null
      - description                = "DCD-CFT-IDAM-DEV Subscription Blob Readers" -> null
      - display_name               = "DTS Blob Readers (sub:dcd-cft-idam-dev)" -> null
      - external_senders_allowed   = false -> null
      - hide_from_address_lists    = false -> null
      - hide_from_outlook_clients  = false -> null
      - id                         = "d33266ed-fd75-4aaa-abcd-c54dfb41fa6c" -> null
      - mail_enabled               = false -> null
      - mail_nickname              = "b298eced-c559-4f67-94a8-1f326c204f98" -> null
      - members                    = [] -> null
      - object_id                  = "d33266ed-fd75-4aaa-abcd-c54dfb41fa6c" -> null
      - onpremises_sync_enabled    = false -> null
      - owners                     = [] -> null
      - prevent_duplicate_names    = false -> null
      - provisioning_options       = [] -> null
      - proxy_addresses            = [] -> null
      - security_enabled           = true -> null
      - types                      = [] -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group_member.members["Contributor-0"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group_member" "members" {
      - group_object_id  = "cc6d3dcf-e452-445f-9656-3f70cdc11672" -> null
      - id               = "cc6d3dcf-e452-445f-9656-3f70cdc11672/member/11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> null
      - member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4" -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group_member.members["Contributor-1"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group_member" "members" {
      - group_object_id  = "cc6d3dcf-e452-445f-9656-3f70cdc11672" -> null
      - id               = "cc6d3dcf-e452-445f-9656-3f70cdc11672/member/53d031cd-a3e5-410e-a694-733874102a45" -> null
      - member_object_id = "53d031cd-a3e5-410e-a694-733874102a45" -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_group_member.members["Reader-0"] will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_group_member" "members" {
      - group_object_id  = "28bc2a45-9313-445b-a09c-2a6f31132d14" -> null
      - id               = "28bc2a45-9313-445b-a09c-2a6f31132d14/member/e6c7b379-03ba-483d-ae1d-f3cab6579a6f" -> null
      - member_object_id = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f" -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuread_service_principal.sp will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuread_service_principal" "sp" {
      - account_enabled              = true -> null
      - alternative_names            = [] -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "fe8dd197-aca7-47d4-9b9b-1f00cfc5278e" -> null
      - application_tenant_id        = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - display_name                 = "DTS Bootstrap (sub:dcd-cft-idam-dev)" -> null
      - homepage_url                 = "https://dts-bootstrap-application" -> null
      - id                           = "53d031cd-a3e5-410e-a694-733874102a45" -> null
      - notification_email_addresses = [] -> null
      - oauth2_permission_scope_ids  = {
          - "user_impersonation" = "2fb7cf65-c035-429f-b737-52e7009c6e50"
        } -> null
      - oauth2_permission_scopes     = [
          - {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cft-idam-dev) on behalf of the signed-in user."
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cft-idam-dev)"
              - enabled                    = true
              - id                         = "2fb7cf65-c035-429f-b737-52e7009c6e50"
              - type                       = "User"
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cft-idam-dev) on your behalf."
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cft-idam-dev)"
              - value                      = "user_impersonation"
            },
        ] -> null
      - object_id                    = "53d031cd-a3e5-410e-a694-733874102a45" -> null
      - owners                       = [] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azuredevops_serviceendpoint_azurerm.endpoint will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      - authorization             = {
          - "scheme" = "ServicePrincipal"
        } -> null
      - azurerm_spn_tenantid      = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - azurerm_subscription_id   = "ddd45636-d58a-437f-8ad8-99b0add0092b" -> null
      - azurerm_subscription_name = "DCD-CFT-Idam-Dev" -> null
      - description               = "Managed by Terraform" -> null
      - id                        = "3228f516-4cd1-490f-99d0-b8f541b3e211" -> null
      - project_id                = "c8947a39-47e3-4236-8bc8-51ff42dbda51" -> null
      - service_endpoint_name     = "DCD-CFT-Idam-Dev" -> null

      - timeouts {}
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_key_vault.kv will be destroyed
  # (because module.subscription["DCD-CFT-Idam-Dev"] is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Backup",
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "Recov

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

03-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "10a0b1dc-9b4f-4d56-8593-8da02f5d3e5d"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DCD-CNP-DEV subscription"
      + display_name                   = "DTS AKS Administrators (sub:dcd-cnp-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DCD-CNP-DEV subscription"
      + display_name                   = "DTS AKS Users (sub:dcd-cnp-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CNP-DEV Subscription Contributors" -> "Grants contributor permissions to the DCD-CNP-DEV subscription"
        id                         = "737069a2-6a1a-45f3-9015-8a3c48b8bcf9"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DCD-CNP-DEV subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dcd-cnp-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CNP-DEV Subscription Owners" -> "Grants owner permissions to the DCD-CNP-DEV subscription"
        id                         = "97ffbeab-b893-4d4e-8338-c772b4467a52"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CNP-DEV Subscription Readers" -> "Grants reader permissions to the DCD-CNP-DEV subscription"
        id                         = "847b4c4a-6bdf-4e35-b8f3-dc6a81b89d57"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-CNP-DEV subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-cnp-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CNP-DEV Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DCD-CNP-DEV subscription"
        id                         = "a2df6e8f-d21a-44a0-aaa4-921fd6f0dc50"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "737069a2-6a1a-45f3-9015-8a3c48b8bcf9"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "6ddb97a3-eed0-4d86-b3ec-c2430df55d7a"
    }

  # module.subscription["DCD-CNP-DEV"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "97ffbeab-b893-4d4e-8338-c772b4467a52"
      + id               = (known after apply)
      + member_object_id = "6ddb97a3-eed0-4d86-b3ec-c2430df55d7a"
    }

  # module.subscription["DCD-CNP-DEV"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "16f2f846-748c-4340-a53c-bde0c3aa137c"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "1f5ffc1f-796b-4973-bfae-57434309eb6e"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c1c4f0704b90c34ef14c9kv"
        name                            = "c1c4f0704b90c34ef14c9kv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c1c4f0704b90c34ef14c9kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c1c4f0704b90c34ef14c9kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://c1c4f0704b90c34ef14c9kv.vault.azure.net/secrets/sp-token/8f6c3c606ef845bfa4787e4599455b8e"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c1c4f0704b90c34ef14c9sa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c1c4f0704b90c34ef14c9sa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/DCD-CNP-DEV"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CNP-DEV"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DCD-CNP-DEV"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 127 to add, 81 to change, 36 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->